rust-travis-ci.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-08 Sat 19:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Setup Travis CI for Rust Diesel project</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Huy Tran" />
<link rel='stylesheet' href='_css/style.css' />
</head>
<body>
<div id="content">
<h1 class="title">Setup Travis CI for Rust Diesel project</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#step-1-rust-version">1. Step 1: Rust version</a></li>
<li><a href="#step-2-postgresql-or-what-ever-database-you-use">2. Step 2: PostgreSQL (or what ever database you use)</a></li>
<li><a href="#step-3-init-your-database-and-migration">3. Step 3: Init your database and migration</a></li>
<li><a href="#step-4-build-and-test">4. Step 4: Build and Test</a></li>
</ul>
</div>
</div>
<p>
Rust is <a href="https://docs.travis-ci.com/user/languages/rust/">supported on Travis CI</a>, there are three main channels of Rust you can use:
<i>stable</i>, <i>beta</i> and <i>nightly</i>. You can just follow their instruction to
get your Rust project build smoothly.
</p>

<p>
But when it come to <a href="https://diesel.rs">diesel.rs</a>, it will be a bit tricky.
</p>

<p>
The reason is, in order to build a diesel-based project, you will need
to have: - A database on your build machine - A <code>.env</code> file with a
configuration to connect to that database - <b>diesel-cli</b> installed to
run migration
</p>

<p>
So, it will require some more configuration.
</p>

<p>
Let's create a <code>.travis.yml</code> file in your project's root folder.
</p>

<div id="outline-container-org32b4167" class="outline-2">
<h2 id="step-1-rust-version"><span class="section-number-2">1</span> Step 1: Rust version</h2>
<div class="outline-text-2" id="text-step-1-rust-version">
<p>
You can select any version of Rust in your Travis CI, put this to your
config file:
</p>

<pre class="example">
language: rust
rust:
  - nightly
  // or
  - 1.22.0
  // or
  - stable
</pre>
</div>
</div>

<div id="outline-container-org3346e1c" class="outline-2">
<h2 id="step-2-postgresql-or-what-ever-database-you-use"><span class="section-number-2">2</span> Step 2: PostgreSQL (or what ever database you use)</h2>
<div class="outline-text-2" id="text-step-2-postgresql-or-what-ever-database-you-use">
<p>
Next, we need to add PostgreSQL as an extra service:
</p>

<pre class="example">
services:
  - postgresql
</pre>

<p>
If you're using a different database, just change it. For the complete
list of supported database, please take a look at
<a href="https://docs.travis-ci.com/user/database-setup/">this document</a>.
</p>
</div>
</div>

<div id="outline-container-org4445884" class="outline-2">
<h2 id="step-3-init-your-database-and-migration"><span class="section-number-2">3</span> Step 3: Init your database and migration</h2>
<div class="outline-text-2" id="text-step-3-init-your-database-and-migration">
<p>
Now we need to do a lot of things, create a databse, install
<b>diesel-cli</b>, create a database and run migration, let create a
<code>before_script</code> section:
</p>

<pre class="example">
before_script:
  - psql -c 'create database build_db;' -U postgres
  - echo "DATABASE_URL=postgres://postgres@localhost/build_db" &gt; .env
  - cargo install diesel_cli --no-default-features --features=postgres
  - diesel migration run
</pre>
</div>
</div>

<div id="outline-container-org0abcdae" class="outline-2">
<h2 id="step-4-build-and-test"><span class="section-number-2">4</span> Step 4: Build and Test</h2>
<div class="outline-text-2" id="text-step-4-build-and-test">
<p>
Finally, build and test your project with <code>cargo</code>:
</p>

<pre class="example">
script:
  - cargo build --verbose --all
  - cargo test --verbose --all
</pre>

<p>
That's all you need!
</p>

<p>
If you are too lazy to follow the four steps,
<a href="https://gist.github.com/huytd/8438a0d3fe1510a483a0499e63a07925">this is a gist</a> for you.
</p>

<p>
<b>P/S:</b> It's worth to mention that due to a lot of <code>cargo</code> run, the build
time is so freaking slow, with the above gist, my project took
approximately 8 to 9 mins per build.
</p>

<p>
You might want to add some caching for <code>cargo</code> in your <code>.travis.yml</code>:
</p>

<pre class="example">
cache: cargo
</pre>

<p>
See more about <a href="https://docs.travis-ci.com/user/caching/">dependencies caching here</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Huy Tran</p>
<p class="date">Created: 2020-02-08 Sat 19:06</p>
</div>
</body>
</html>
